Revit 2026 API

# SelectionPickElementsByRectangle(ISelectionFilter, String) Method

---

Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter while showing a custom status prompt string.

**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Element> PickElementsByRectangle(
	ISelectionFilter selectionFilter,
	string statusPrompt
)
```
```vb
Public Function PickElementsByRectangle (
	selectionFilter As ISelectionFilter,
	statusPrompt As String
) As IList(Of Element)
```
```cpp
public:
IList<Element^>^ PickElementsByRectangle(
	ISelectionFilter^ selectionFilter,
	String^ statusPrompt
)
```
```fsharp
member PickElementsByRectangle :
        selectionFilter : ISelectionFilter *
        statusPrompt : string -> IList<Element>
```

#### Parameters

selectionFilter ISelectionFilter
    The selection filter.
statusPrompt String
    The message shown on the status bar.

#### Return Value

IListElement

A collection of elements selected by the user.

Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the selectionFilter is  or statusPrompt is . |
| OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode. |
| ForbiddenForDynamicUpdateException | Thrown if this method is called during dynamic update. |

Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view), but will not be permitted to click other items in the Revit user interface. Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.

The selection will not be automatically added to the active selection buffer.

Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.

#### Reference

Selection Class

PickElementsByRectangle Overload

Autodesk.Revit.UI.Selection Namespace